[
  {
    "title": "Technical Director at Cura Fitness",
    "date": "2020-07-30",
    "description": "Cura Fitness is a boutique fitness studio based in County Down, Northern Ireland. I run the back office operations including finance, data, technology, systems and administration.",
    "website": "https://curafitness.com/"
  },
  {
    "title": "Interviewer at Analysts Assemble",
    "date": "2020-07-20",
    "description": "I interview top data analysts from a wide range of industries to find out about their career journey and how they build their data skills.",
    "website": "https://analystsassemble.com"
  },
  {
    "title": "Course Creator at SQL Crash Course",
    "date": "2020-07-30",
    "description": "I created an online SQL course to help people build the solid groundwork they need to get up to speed quickly with SQL.",
    "website": "https://sqlcrashcourse.com/",
    "repo": "https://github.com/santino79/simple-sql-crash-course"
  },
  {
    "title": "Writer here and elsewhere",
    "date": "2020-07-30",
    "description": "This is my personal website where I write articles on a variety of topics including business, personal finance, tech, careers, writing and my quest to build a simple kind of life. I've been a professional writer with clients including About.com and The New York Times Company. These days, I am a contributing writer on Towards Data Science, Hacker Noon and Dev.to.",
    "website": "https://alanhylands.com/writing/"
  },
  {
    "title": "Founder at Santinotech",
    "date": "2020-07-30",
    "description": "Santinotech was the umbrella for my tech consultancy and development projects. I helped small teams use their data and technology to build stronger, more ethical, data-informed businesses."
  },
  {
    "title": "Liz's Lockets",
    "date": "2016-12-31",
    "description": "Liz's Lockets was my wife's e-commerce business which sold memory lockets and costume jewellery. I built and ran the e-commerce store. I also appeared regularly as her Lovely Debbie McGee at craft fairs and markets when we took the business out on the road. Soon to be re-launched with our 9 year old daughter at the helm as her first taste of entrepreneurship.",
    "website": "https://lizslockets.com"
  },
  {
    "title": "Sports Boffin",
    "date": "2012-01-01",
    "description": "Sports Boffin was a sports betting prediction engine. I started with football (of course) and built a full data platform on MS SQL Server. Match results and betting odds were scraped and loaded daily. I built a predictive algorithm that compared each game to the two sides' previous form in similarly matched encounters (based on my modified homespun version of Rateform)."
  },
  {
    "title": "Liquid Gem",
    "date": "2012-07-01",
    "description": "Liquid Gem was a Business Intelligence and Marketing Strategy consultancy I set up in 2011 with some old comrades. We did some great work in Irish banking and made some contacts in New York. We parked it in late 2012 when a too good to turn down offer to go in-house at our main client came up."
  },
  {
    "title": "Liquid Voices",
    "date": "2012-07-30",
    "description": "Liquid Voices was one of the projects we spun out from Liquid Gem back in 2012. A B2C membership site which let members complete online surveys for companies and compete to win prizes and earn rewards."
  },
  {
    "title": "State of the Game",
    "date": "2006-02-01",
    "description": "State of the Game was a football blog I started in 2005. It grew massively for a few years and gave me the opportunity to become a professional football writer for About.com and The New York Times Company. I covered more of the back story in an article called I Want To Be A Football Writer When I Grow Up."
  },
  {
    "title": "White Storm",
    "date": "2003-03-05",
    "description": "White Storm was my first e-commerce development agency, started in 2003. It stayed with me either as my full-time focus or as a vehicle for my side projects until 2007 when I set it aside and joined the big bad world of banking."
  }
]
