[
    {
        "date": "2021-05-07", 
        "title": "Born Slippy (Nuxx) - Underworld",
        "description": "This one came on a  playlist while I was doing my workout warm up this morning and I was instantly transported back to the late 90s. Hell of a flashback for 7AM on a Friday morning but there you go.It went big after being featured in the movie Trainspotting but I remember it playing everywhere in clubs when I was finishing school and starting uni. Turn it up loud and (vicariously) relive my mis-spent student days with me. This is Born Slippy by Underworld.", 
        "link": "https://open.spotify.com/track/7xQYVjs4wZNdCwO0EeAWMC?si=d3d1c3f300f0436a"
    },
    {
        "date": "2021-04-30", 
        "title": "Thunderstruck - AC/DC",
        "description": "Classic rock doesn’t get any more classic than AC/DC so this week we’re going with DC doing Thunderstruck. One of my all-time favourite guitar riffs that almost got ruined completely for me when Liz started to use this song as a warm-up routine in the fitness studio. Every time Brian says the word “Thunder” you had to do a burpee. By the end of the song I was ready to :face_vomiting: and that was just the warm-up…", 
        "link": "https://www.youtube.com/watch?v=v2AC41dglnM"
    },
    {
        "date": "2021-04-23", 
        "title": "Lounge Act (live at Reading Festival 1992) - Nirvana",
        "description": "Never a bad time to put on some Nirvana. Definitely an underrated track off Nevermind that sometimes gets lost but it’s worth it just for the bassline alone. This is Lounge Act live at the Reading Festival in 1992.", 
        "link": "https://www.youtube.com/watch?v=7xeasq05zxc"
    },
    {
        "date": "2021-04-16",
        "title": "Gimme Shelter (live) - Rolling Stones",
        "description": "It’s no secret I’m a big fan of the Stones so we’ll go with a great live version of Gimme Shelter. It’s really a showcase for Lisa Fischer who sang with them for years. She blows Jagger off the stage vocally. What a voice. It takes a strong performer to overshadow Merry Clayton’s vocals on the studio original but I think Lisa does it here. Amazing.", 
        "link": "https://www.youtube.com/watch?v=6yGFuX2KDQs"
    },
    {
        "date": "2021-04-02", 
        "title": "Leave - REM",
        "description": "Hadn’t heard this tune in years until we watched the movie A Life Less Ordinary a few weeks ago and up it popped at a crucial scene.This is a live version but the studio one is top class with the siren wailing away and an (as always) impassioned vocal from Michael Stipe.", 
        "link": "https://www.youtube.com/watch?v=gb4CEDpT3aY"
    },
    {
        "date": "2021-03-26", 
        "title": "Smells Like...Never Gonna Give You Up (live) - Foo Fighters & Rick Astley",
        "description": "Late entry for last week. We went down a Youtube rabbit hole at the weekend watching different mashups and remixes folks have put together. One of my favourites was Smells Like Teen Spirit with Rick Astley ‘s vocals for Never Gonna Give You Up over it. To compound my happiness there are a load of videos of Rick getting up on stage with Foo Fighters to play it live. Hurrah! This a little mellower with less gratuitous use of the MFer naughty word on stage though…Rick Astley doing an acoustic cover of the Foo Fighters’ Everlong.", 
        "link": "https://www.youtube.com/watch?v=C5oeWHngDS4"
    },
    {
        "date": "2021-03-12", 
        "title": "What Time Is Love? - The KLF",
        "description": "This one takes me right back to the early 90s. We were allowed to put our own music on in art class at school and I brought my cassette copy of The KLF’s White Room album.Their story is crazy, from burning a suitcase with £1m royalties in it to deleting their back catalogue until about 2 months ago. Don’t know how big they were in Europe or the US but this was a big tune in the UK at the time. Still holds up well too. (There’s a naughty word right at the start so be warned if you’re offended by such language.)", 
        "link": "https://www.youtube.com/watch?v=UIbYM1ecT2I"
    },
    {
        "date": "2021-03-05", 
        "title": "Tragedy - The Bee Gees",
        "description": "I’m going to have to go for the  #1 on the day I was born. Luckily that was at the tail end of disco so we get the joy of the Bee Gees doing Tragedy. I’m getting very close to Barry Gibb’s hair volume given the lack of hair cuts under lockdown but I’d need to squeeze into a similarly tight pair of trousers if I was to get close to hitting these high notes he’s singing.", 
        "link": "https://www.youtube.com/watch?v=WJcozEOWgxI"
    },
    {
        "date": "2021-02-26", 
        "title": "A Life Less Ordinary - Ash",
        "description": "Local connection for me on this one as I’ve chosen Northern Irish band Ash’s 1997 single A Life Less Ordinary.They come from a town not too far away and are only a couple of years older than me so I was mad into their debut album 1977 when it went big in the UK.The three guys added a new guitarist, Charlotte, the year after and did this single which was the title track for Danny Boyle’s movie of the same name.My brother and I went to see Ash live in Belfast the following year and, being two teenage boys who loved guitars and loud music, stood transfixed watching Charlotte spin around rocking out on her SG. When we got our own band together a year later, this was one of the first cover versions we played.", 
        "link": "https://www.youtube.com/watch?v=szUeXBaOfl4"
    },
    {
        "date": "2021-02-12", 
        "title": "I Learned My Lesson - Willie Davis",
        "description": "Mentioning Suits has put me back onto a lot of great tunes I picked up watching that show. Lot of great soul and blues stuff as much as more modern rock and indie. The music directors really upped their game on that show.This is one by Willie Davis called I Learned My Lesson.", 
        "link": "https://open.spotify.com/track/7od76pZL6us0BmiIODgiPT?si=62196b834fef4afa"
    },
    {
        "date": "2021-01-29", 
        "title": "Where Is My Mind? (live) - Pixies",
        "description": "With all of the GameStop / :reddit-alien: / :robin-hood: carry-on of the past few days, there have been more than a few mentions of the iconic final scene from Fight Club. The visual of that scene was hard hitting enough but this song playing over it just elevated it to another level altogether. But long before there was Fight Club. Before Cobain tried to copy their sound when he wrote Smells Like Teen Spirit. Before the 1990s, that their sound influenced so much, had even begun… There was a band from Boston called Pixies. And this is them playing Where Is My Mind? live in 1988.", 
        "link": "https://www.youtube.com/watch?v=I_aBmrYChfQ"
    },
    {
        "date": "2021-01-22", 
        "title": "Cruel Summer - Evanescence",
        "description": "We’ve been binge watching Cobra Kai over the past week after I got the kids to watch all 3 of The Karate Kid movies (I don’t recognise the Hilary Swank or Jackie Chan ones - don’t @ me).I’m loving the throwbacks to the original movies and the nostalgia from seeing these characters all these years later. Thew writing, especially for Johnny, is top notch, really funny without dissolving into mindless cheesiness. Well worth a watch.The original version of this song played a big part in KK1 but this is a cover by Evanescence just to mix things up a little.", 
        "link": "https://www.youtube.com/watch?v=paQsE53YkVU"
    },
    {
        "date": "2021-01-15", 
        "title": "The Pretender (live) - Foo Fighters",
        "description": "It was Dave Grohl’s birthday yesterday so has to be a Foo Fighters tune.This is The Pretender live at Wembley in 2008.(Only sad part of this video is that I used to have a gold top Les Paul with the P90s like the one Shiflett is playing and I sold it to my mate to help pay the mortgage just before I started working in my old job back in 2007. Should have kept it.  )", 
        "link": "https://www.youtube.com/watch?v=KvrN6f95GOw"
    },
    {
        "date": "2021-01-08", 
        "title": "Starman (live at TOTP) - David Bowie",
        "description": "On what would have been his 74th birthday, we’ll have to kick off today’s musical proceedings with the one and only Mr David Bowie. This is Starman, live on British TV show Top Of The Pops. Bowie is majestic as always but special mention to Mick Ronson’s gold shiny tracksuit which gives him the look of Goldmember from the Austin Powers movie. Brilliant.", 
        "link": "https://www.youtube.com/watch?v=mYtRp9UNx8Y"
    },
    {
        "date": "2020-12-18", 
        "title": "Last Christmas - Jimmy Eat World",
        "description": "** SPECIAL BONUS CHRISTMAS EDITION ** I’ve made it clear that I am very much a grinch when it comes to the usual festive cheer at this time of year but just to show I’m not a complete misery, I’m going with some alternatives to the usual traditional Yuletide tunes.First up is one of my favourite bands, Jimmy Eat World covering Wham’s Last Christmas.", 
        "link": "https://www.youtube.com/watch?v=iXfq73KRKxI"
    },
    {
        "date": "2020-12-18", 
        "title": "Yule Shoot Your Eye Out - Fall Out Boy",
        "description": "(BAD LANGUAGE WARNING: Pete says a few naughty words at the start of this one.)Sticking to the alt / indie / emo genre, this is Fall Out Boy doing an almost acoustic live version of Yule Shoot Your Eye Out:", 
        "link": "https://www.youtube.com/watch?v=Einje3x7xuo"
    },
    {
        "date": "2020-12-18", 
        "title": "Christmas Time - Smashing Pumpkins",
        "description": "I can’t think of anyone more unlikely to be a lover of  than Billy Corgan and yet here we go with Smashing Pumpkins song Christmas Time, resplendent with   and everything.I’m still a little surprised this exists to be honest.", 
        "link": "https://www.youtube.com/watch?v=fmFeg2e5GzI"
    },
    {
        "date": "2020-12-18", 
        "title": "Merry Christmas (I Don't Wanna Fight Tonight) - The Ramones",
        "description": "And to round off my choices, what could be any more Christmassy than The Ramones doing Merry Christmas (I Don’t Wanna Fight Tonight):", 
        "link": "https://www.youtube.com/watch?v=pTgaD3pwRTc"
    },
    {
        "date": "2020-12-11", 
        "title": "Sassafras Roots (live) - Green Day",
        "description": "I had a 45 minute each way drive last week to get my blood test which is the longest I’ve had full control of the music in the car on my own for many years. This song came on and was played very VERY loud.My friends and I were big Green Day fans growing up. Dookie had been a massive hit album for them in the mid 90s and we cut our guitar playing teeth learning all the songs. If I’d practised a bit more Hendrix and Clapton I might be a better guitarist but 3 power chords and some Northern California punk attitude won the day back then.This is a live version of Sassafras Roots from the Reading Festival in 2013:", 
        "link": "https://www.youtube.com/watch?v=058_IFSUxr8"
    },
    {
        "date": "2020-12-11", 
        "title": "Teenage Kicks - The Undertones",
        "description": "And just to show Northern Ireland didn’t always have to import it’s pop-punkiness from across the Atlantic, here are two of our best bands from the late 70s doing their stuff.The Undertones with Teenage Kicks:", 
        "link": "https://www.youtube.com/watch?v=PinCg7IGqHg"
    },
    {
        "date": "2020-12-11", 
        "title": "Alternative Ulster - Stiff Little Fingers",
        "description": "And Stiff Little Fingers with Alternative Ulster:", 
        "link": "https://www.youtube.com/watch?v=O5vCgtpY0Kg"
    },
    {
        "date": "2020-11-27", 
        "title": "Smells Like...The Watchtower - Unfortunate SOns",
        "description": "My friend sent me a link to this yesterday and it’s worth turning up loud for a good blast. Cover of All Along The Watchtower mashed up with Smells Like Teen Spirit. Two great songs so what’s not to like?", 
        "link": "https://www.youtube.com/watch?v=erHEmoH7zLc"
    },
    {
        "date": "2020-11-20", 
        "title": "Homeward Bound (live on SNL) - Paul Simon & George Harrison",
        "description": "Given last night’s NI Executive announcement that a stricter lockdown is going to close businesses until the middle of December, I’m in the mood for something loud and filled with expletives.I’ll keep those tunes to myself however and instead share this video of George Harrison and Paul Simon on SNL in the mid 70s performing Homeward Bound which is one of my favourite Simon & Garfunkel tracks.", 
        "link": "https://www.youtube.com/watch?v=UODI6JmUnMA"
    },
    {
        "date": "2020-11-20", 
        "title": "Dammit - Ruston Kelly",
        "description": "100% will be checking that Dammit album out over the weekend.My friend had sent me over an acoustic cover of it last week strangely so it must be the cover version of choice for everyone these days - which I wholeheartedly approve of. Excellent tune.", 
        "link": "https://open.spotify.com/track/7xkPw5434ZqWJdozkTED3f"
    },
    {
        "date": "2020-11-13", 
        "title": "Missing (Todd Terry Remix) - EBTG",
        "description":"I was watching a show last weekend about BBC Radio DJ Annie Nightingale and her journey through a lot of post-punk and New Wave music. One of the videos she played was a band called Marine Girls which was an early band of Tracey Thorn, the singer from Everything But The Girl. This is the Todd Terry remix of EBTG’s Missing from 1995. Still sounds as fresh as it did back then and Tracey’s vocal is great.", 
        "link": "https://www.youtube.com/watch?v=IAkY5m00rpY"
    },
    {
        "date": "2020-11-06", 
        "title": "Core 'ngrato - The Three Tenors",
        "description": "Little bit of culture for us this week. I can’t claim to be an opera expert in any way, shape or form but there is no denying the power of these three singing together. Hearing Pavarotti sing Nessum Dorma as the theme song to the Italia ’90 World Cup made a big impression on 11 year old me and although it was more Guns N Roses, Green Day and Oasis as my teenage years went on, I always enjoy revisiting some opera from time to time. This is the Three Tenors singing Core ’ngrato live in Paris.", 
        "link": "https://www.youtube.com/watch?v=dTq46yOaYWI"
    },
    {
        "date": "2020-11-06", 
        "title": "Red Right Hand - Nick Cave",
        "description": "That’s proper dedication  I’ve dipped into a few of his tunes over years but never a deep dive. I may get on the Vitamin D supplements before I go that far though.Put Red Right Hand on after it there and now I want to go watch Peaky Blinders.", 
        "link": "https://open.spotify.com/track/0qHeP8zt2WWef7EWCs1ECj"
    },
    {
        "date": "2020-11-06", 
        "title": "Into My Arms - Nick Cave",
        "description": "Off I go down a Nick Cave rabbit hole. What a tune Into My Arms is:", 
        "link": "https://open.spotify.com/track/407ltk0BtcZI8kgu0HH4Yj"
    },
    {
        "date": "2020-10-23", 
        "title": "Rockefeller Skank - Fatboy Slim",
        "description": "Bit of a blast from the past on this one. Put it on for the kids yesterday and had them bopping around the kitchen.Started with Happy Hour by The Housemartins then explained how Paul from that band formed Beautiful South and, some years later, the bass player Norman became Fatboy Slim and was a really big DJ. Thought this was as good a choice as any.", 
        "link": "https://www.youtube.com/watch?v=FMrIy9zm7QY"
    },
    {
        "date": "2020-10-16", 
        "title": "No TIme To Die - Billie Eilish",
        "description": "We go back into lockdown this evening at 6pm. Schools are closing for an extended Hallowe’en break. Bars, restaurants and cafes are closing. Gyms are personal training only. No visiting other households. No unnecessary travel. And no James Bond movie release until next year.  No Time To Die seems particularly apt as the plague walks among us again. (Yes, I’m in full-on melodramatic mode today.  )", 
        "link": "https://www.youtube.com/watch?v=BboMpayJomw"
    },
    {
        "date": "2020-10-09", 
        "title": "Oh So Protective One - Girls",
        "description": "How I found this EP, Broken Dreams Club by indie band Girls, is lost in the mists of time but I think I was hunting for new music and saw an interesting review online (possibly on Pitchfork now I think about it).My favourite song is Oh So Protective One which is my choice this week but the whole EP is well worth a listen. Bit of a melancholic vocal over a 1950s-influenced tune with a very agreeable trumpet break and some top notch teenage insecurity inspired lyrics. I somehow forget about it for a few years at at time then it jumps out of a random mix on my old iPod in the car and wonder why I haven’t listened to it in so long.(Plus there’s a live video on Youtube where the singer plays a Rickenbacker which, given my recent Beatles revival, is a very good omen of guitar-based taste.)", 
        "link": "https://open.spotify.com/track/6CJV6qg9GUaeZIg9Zk2gMp"
    },
    {
        "date": "2020-10-02", 
        "title": "Superstar - SOnic Youth",
        "description": "Karen Carpenter was trending on Twitter this week in the UK, mostly because a new TV advert has a cover of one of their songs on it. I’m bringing an alternative rock slant on a cover of The Carpenters’ own cover of Delaney and Bonnie’s Groupie (Superstar) courtesy of Sonic Youth. (Uplifting it is not but I like a cover that does something different with a tune. Also features on the pretty good Juno soundtrack as well,)", 
        "link": "https://www.youtube.com/watch?v=Y21VecIIdBI"
    },
    {
        "date": "2020-09-25", 
        "title": "I Love To Love - Tina Charles",
        "description": "Bit of a 70s disco vibe this week. It features in the TV mini-series River starring Stellan Skarsgård and Nicola Walker and has become a firm favourite of mine when the  mood takes me.Sadly, River only ran for one season (should be available on  for anyone who hasn’t seen it). He was a great character and I’m a big fan of Stellan and Nicola so it’s worth a watch if you like your crime/police stories with a twist.Before that, turn your speakers up loud, get your dancing gear on and give Tina Charles some respect.", 
        "link": "https://www.youtube.com/watch?v=nS7YL8JCSzo"
    },
    {
        "date": "2020-09-18", 
        "title": "Progress - Public Service Broadcasting",
        "description": "(Spoiler alert: not an uplifting subject this week - be warned).We were watching an episode of The Crown last night and it covered the 1966 Aberfan disaster where a coal mining spoil tip slid into a small village in Wales killing 144 people, 116 of them children.In the spirit of Welsh coal mining, my choice comes from the album Every Valley by British band Public Service Broadcasting. It’s a concept album based on the rise and decline of the Welsh coal industry in the second half of the 20th century.Sounds absolutely riveting Alan you might think but it’s incredibly well done and very powerful as a full piece of artistic work. I really do recommend giving it a full listen.This song, Progress, was the lead single and features singer Tracyanne Campbell of Scottish band Camera Obscura on guest vocals.", 
        "link": "https://www.youtube.com/watch?v=x1ZbdGBAqZQ"
    },
    {
        "date": "2020-09-11", 
        "title": "Insomnia - Faithless",
        "description": "I’m not usually a dance music fan but @toju posted this on  through the week and it took me back about 20 years to a time when I didn’t just sit in the house every Saturday night. Great track and well worth the wait for the recognisable bit to come in near the end.", 
        "link": "https://open.spotify.com/track/5z5wYWL1IO6y2yEFBOiGt0"
    },
    {
        "date": "2020-09-04", 
        "title": "Pretty In Pink - Psychedelic Furs",
        "description": "We re-watched a couple of classic John Hughes mid-1980s movies last weekend (Sixteen Candles and Pretty In Pink) and I’ve had The Psychedelic Furs in my head all week.", 
        "link": "https://www.youtube.com/watch?v=RuWmsg-ihLg"
    },
    {
        "date": "2020-09-04", 
        "title": "Across The Universe - The Beatles",
        "description": "I’ve also been watching a little of the recent movie Yesterday with the kids so been back on a  binge. My favourite song changes on a daily basis but Across The Universe is hard to beat so well worth another listen.", 
        "link": "https://www.youtube.com/watch?v=90M60PzmxEE"
    },
    {
        "date": "2020-09-04", 
        "title": "Dark Skies - Saint Swell",
        "description": "And I’ll finish my thread takeover with a suggestion borne out of nepotism. This is a song my brother and his wife recently released. They’ve had a few bands over the years but hadn’t released anything new in years while their kids were young. Thankfully lockdown gave them an opportunity to get writing again.", 
        "link": "https://open.spotify.com/track/4fntPyWAHo34lCS27CCACn?si=sSJFA171QranSooaZpEleA"
    },
    {
        "date": "2020-08-28", 
        "title": "Never Too Much - Luther Vandross",
        "description": "This one came on the radio in the car the other day and the whole family were grooving to it. Luther’s voice and the guitar lick make it all worthwhile but I love the shot of the old school boom box at the start of this video ", 
        "link": "https://www.youtube.com/watch?v=pNj9bXKGOiI"
    },
    {
        "date": "2020-08-14", 
        "title": "Southern Man - Merry Clayton",
        "description": "I’ve been listening to a lot of Neil Young again since I watched the Laurel Canyon documentary a couple of weeks ago. This is Merry Clayton’s version of Southern Man.I first heard this on a business trip to London a few years ago. Some colleagues and I had flown down from Edinburgh and enjoyed a few complimentary beverages in the executive lounge before the flight. We got a train and taxi over to our hotel (Ace Hotel in Shoreditch) and when we walked into reception the house DJ was playing this track. Set the tone for the rest of that evening Good trip but my head was banging more than the tunes the next morning…", 
        "link": "https://www.youtube.com/watch?v=ItXxsxlSrQQ"
    },
    {
        "date": "2020-08-07", 
        "title": "Tomorrow We Will Run Faster - Mark Donaldson Group",
        "description": "Finding myself listening to a lot more instrumental music these days especially while working as I can’t concentrate properly with lyrics happening. Had this one on the other day, it’s by a guy I used to work with in the bank, really talented musician across the board whether it’s shredding guitar or playing classical piano.(Here it’s more face melting guitar work…)", 
        "link": "https://www.youtube.com/watch?v=X9WJhlBHmX8"
    },
    {
        "date": "2020-08-07", 
        "title": "1979 (live on Howard Stern) - Billy Corgan",
        "description": "No rambling personal biography this week but hearing this one takes me back 20 odd years. I played the official video of it for my kids recently in the hopes of converting them to Pumpkins fans but might be a little early in their musical journey for that just yet  ", 
        "link": "https://www.youtube.com/watch?v=WQe3OEK7Wgw"
    },
    {
        "date": "2020-07-31", 
        "title": "Man of the World - Fleetwood Mac",
        "description": "I’m going with two choices again this week because…well, they are both worth it. First up is a tribute to the late, great Peter Green who sadly passed away last weekend. His life story makes for tragic reading but his early work with Fleetwood Mac stands the test of time.I was lucky enough to see him play live in Belfast ten years ago when he went back out on the road with friends. While he was far from the blues legend of old I was glad that he’d been able to beat his demons for a while and see firsthand how well thought of he was by fans.Bit of a mood killer this one but musically and lyrically it’s ", 
        "link": "https://www.youtube.com/watch?v=9GPR848mhIs"
    },
    {
        "date": "2020-07-31", 
        "title": "Our House - CSNY",
        "description": "For song #2, I’m going with Crosby, Stills, Nash and Young. Liz and I are massive fans of 1960s music in general and have been watching the recent documentary “Laurel Canyon”.In the docu, Graham Nash tells the story again about how he wrote Our House after a shopping trip with Joni Mitchell where they bought the vase he sings about. I love it.Check out the documentary if you can as well, lots of interviews from the big names from that scene and a ton of great tunes.", 
        "link": "https://www.youtube.com/watch?v=U8ljtylRkFw"
    },
    {
        "date": "2020-07-24", 
        "title": "Shipbuilding - Elvis Costello",
        "description": "My choice this week could have went one of two ways: 1) Go with the catchy Scandipop delights of my kids’ choice of Jaja Ding Dong from Will Ferrell’s Eurovision movie soundtrack or 2) A rather more downbeat, anti-war ode from Elvis Costello. I went with this one.Costello wrote Shipbuilding during the Falklands War between the UK and Argentina in 1982. His storytelling is second to none and this is a fantastic example of that.It’s also notable for being one of the last recordings of legendary jazz trumpet player Chet Baker (cc @erinoz (she/her)). His work takes it to another level altogether and would be worth the listen on it’s own.(Thanks to @elliott for the Billy Bragg tune last week that got me back in the mood for Costello).", 
        "link": "https://www.youtube.com/watch?v=IuPrrdRzlxc"
    },
    {
        "date": "2020-07-24", 
        "title": "Ja Ja Ding Dong (from the Eurovision movie)",
        "description": "Ah, stuff it, I can’t resist this one either ", 
        "link": "https://www.youtube.com/watch?v=PlBUH8zMZng"
    },
    {
        "date": "2020-07-10", 
        "title": "Kevin Carter - Manic Street Preachers",
        "description": "The horn section riff (which comes in around the 1:15 mark) has been in my head all week so my choice is Manic Street Preachers - Kevin Carter.I listened to their Everything Must Go album non-stop on it’s release in 1996 as they made the crossover to the mainstream on the back of the Britpop wave and the disappearance of guitarist Richey Edwards.The backstory to the song is an interesting if tragic tale about Pulitzer Prize winning photojournalist Kevin Carter who sadly took his own life after witnessing some true horrors in Sudan.", 
        "link": "https://www.youtube.com/watch?v=hLDr0QNCUd4"
    },
    {
        "date": "2020-07-06", 
        "title": "The Ecstasy of Gold - Ennio Morricone",
        "description": "Just been reading the news that composer Ennio Morricone has died so today’s choice is a tribute to him.My dad is a massive Clint Eastwood fan and, while cowboy movies were never my thing, Morricone’s music immediately brings that genre to mind.This is “The Ecstasy Of Gold” from Sergio Leone’s The Good, The Bad and The Ugly.", 
        "link": "https://www.youtube.com/watch?v=PYI09PMNazw"
    },
    {
        "date": "2020-06-26", 
        "title": "In the Still of the Night - The Five Satins",
        "description": "For my choice this week, I’m going with a classic golden oldie from The Five Satins. I’ve been re-watching The Irishman this week and this was perfectly placed in it.", 
        "link": "https://open.spotify.com/track/1RrwTCZzpnfOatmr2zj6mJ?si=GqM5p49rSvynkJOX7Lp6-Q"
    },
    {
        "date": "2020-06-19", 
        "title": "Clarity - Jimmy Eat World",
        "description": "Taking a break from fence repair duties to share this one. Jimmy Eat World have been one of my favourite bands for years, saw them four times live so far.I was on a call with local councillors about businesses re-opening during the week and one person kept asking for clarity. So here it is.", 
        "link": "https://open.spotify.com/track/47yXVjpiJnZB5VxxAL782h?si=LYIFIs-5THm3-V0ef2mcdg"
    },
    {
        "date": "2020-06-12", 
        "title": "Xanadu - Olivia Newton John",
        "description": "I was going to kick this off with a really cool choice to show what a musical snob I am and try and impress you all with my musical knowledge.Instead, Liz and the kids have been wandering round the house singing this song this morning and it’s stuck in my head. They sing it when we do karaoke and I’ve loved Olivia Newton-John since I was 10. No better reasons.", 
        "link": "https://www.youtube.com/watch?v=cLi8fTlDEag"
    }
]